---------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\Github\twitteRCT\results/statareg.log
  log type:  text
 opened on:  12 May 2016, 10:40:23

. 
. insheet using "data/user_days.csv"
(34 vars, 150,337 obs)

. 
. duplicates report user_id date

Duplicates in terms of user_id date

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |       150223             0
        2 |          114            57
--------------------------------------

. 
. duplicates drop user_id date, force

Duplicates in terms of user_id date

(57 observations deleted)

. 
. duplicates report user_id date

Duplicates in terms of user_id date

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |       150280             0
--------------------------------------

. 
. 
. encode date, generate(date_d2)

. 
. xtset user_id date_d2
       panel variable:  user_id (strongly balanced)
        time variable:  date_d2, 1 to 34
                delta:  1 unit

. 
. local temptweets temptweet1 temptweet2 temptweet3 temptweet4 temptweet5 ///
>         temptweet6 temptweet7

. 
. xtreg like_n `temptweets' i.date_d2, fe

Fixed-effects (within) regression               Number of obs     =    150,280
Group variable: user_id                         Number of groups  =      4,420

R-sq:                                           Obs per group:
     within  = 0.0887                                         min =         34
     between = 0.0001                                         avg =       34.0
     overall = 0.0451                                         max =         34

                                                F(40,145820)      =     354.79
corr(u_i, Xb)  = 0.0000                         Prob > F          =     0.0000

------------------------------------------------------------------------------
      like_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  temptweet1 |   .0533877   .0372589     1.43   0.152    -.0196389    .1264144
  temptweet2 |   .0039694   .0476882     0.08   0.934    -.0894985    .0974372
  temptweet3 |  -.0290392   .0405324    -0.72   0.474    -.1084818    .0504035
  temptweet4 |  -.0355575   .0481035    -0.74   0.460    -.1298393    .0587244
  temptweet5 |  -.0851734   .0477882    -1.78   0.075    -.1788373    .0084905
  temptweet6 |  -.0481163   .0682025    -0.71   0.481    -.1817919    .0855593
  temptweet7 |  -.0127136   .0275558    -0.46   0.645    -.0667223    .0412952
             |
     date_d2 |
 2016-04-08  |   .1595023   .0372962     4.28   0.000     .0864025    .2326021
 2016-04-09  |   .3237557   .0372962     8.68   0.000     .2506559    .3968555
 2016-04-10  |   .5221719   .0372962    14.00   0.000     .4490721    .5952717
 2016-04-11  |   .9377828   .0372962    25.14   0.000      .864683    1.010883
 2016-04-12  |   .3522624   .0372962     9.44   0.000     .2791626    .4253622
 2016-04-13  |    .191629   .0372962     5.14   0.000     .1185292    .2647288
 2016-04-14  |   .6259085   .0373029    16.78   0.000     .5527955    .6990214
 2016-04-15  |   .2275419   .0373386     6.09   0.000      .154359    .3007248
 2016-04-16  |   1.156065   .0373948    30.92   0.000     1.082772    1.229359
 2016-04-17  |   1.357376   .0374946    36.20   0.000     1.283887    1.430865
 2016-04-18  |   .6497394   .0379421    17.12   0.000     .5753736    .7241053
 2016-04-19  |   1.532112   .0380922    40.22   0.000     1.457452    1.606772
 2016-04-20  |    1.41436   .0380221    37.20   0.000     1.339837    1.488882
 2016-04-21  |   1.217246   .0384803    31.63   0.000     1.141825    1.292667
 2016-04-22  |   .4885892   .0381561    12.81   0.000     .4138039    .5633744
 2016-04-23  |   1.068262   .0383447    27.86   0.000     .9931073    1.143417
 2016-04-24  |   .9370681   .0383973    24.40   0.000     .8618103    1.012326
 2016-04-25  |    1.40579   .0380858    36.91   0.000     1.331143    1.480437
 2016-04-26  |   1.454975   .0387158    37.58   0.000     1.379092    1.530857
 2016-04-27  |   1.500392    .038223    39.25   0.000     1.425476    1.575309
 2016-04-28  |   1.871601   .0388094    48.23   0.000     1.795535    1.947667
 2016-04-29  |   1.160965   .0386106    30.07   0.000     1.085289    1.236641
 2016-04-30  |   .8587333   .0380004    22.60   0.000     .7842533    .9332134
 2016-05-01  |   1.172574   .0378082    31.01   0.000     1.098471    1.246677
 2016-05-02  |   1.479588   .0378082    39.13   0.000     1.405484    1.553691
 2016-05-03  |   1.366918   .0378082    36.15   0.000     1.292815    1.441021
 2016-05-04  |   .7413522   .0378082    19.61   0.000      .667249    .8154555
 2016-05-05  |   .5135242   .0378082    13.58   0.000     .4394209    .5876274
 2016-05-06  |    2.21556   .0378082    58.60   0.000     2.141457    2.289664
 2016-05-07  |   1.205606   .0378082    31.89   0.000     1.131502    1.279709
 2016-05-08  |    .798592   .0378082    21.12   0.000     .7244888    .8726953
 2016-05-09  |   1.847913   .0378082    48.88   0.000      1.77381    1.922017
 2016-05-10  |   1.521216   .0378082    40.24   0.000     1.447113     1.59532
             |
       _cons |   .1285068   .0263724     4.87   0.000     .0768174    .1801962
-------------+----------------------------------------------------------------
     sigma_u |  1.7809032
     sigma_e |  1.7533178
         rho |  .50780474   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4419, 145820) = 35.07               Prob > F = 0.0000

. 
. xtreg like_n `temptweets' i.date_d2, fe cluster(user_id)

Fixed-effects (within) regression               Number of obs     =    150,280
Group variable: user_id                         Number of groups  =      4,420

R-sq:                                           Obs per group:
     within  = 0.0887                                         min =         34
     between = 0.0001                                         avg =       34.0
     overall = 0.0451                                         max =         34

                                                F(40,4419)        =      61.48
corr(u_i, Xb)  = 0.0000                         Prob > F          =     0.0000

                            (Std. Err. adjusted for 4,420 clusters in user_id)
------------------------------------------------------------------------------
             |               Robust
      like_n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  temptweet1 |   .0533877   .0596378     0.90   0.371    -.0635323    .1703078
  temptweet2 |   .0039694     .05914     0.07   0.946    -.1119747    .1199134
  temptweet3 |  -.0290392   .0589136    -0.49   0.622    -.1445393     .086461
  temptweet4 |  -.0355575   .0847947    -0.42   0.675    -.2017976    .1306827
  temptweet5 |  -.0851734   .0874552    -0.97   0.330    -.2566294    .0862825
  temptweet6 |  -.0481163   .0669095    -0.72   0.472    -.1792925    .0830599
  temptweet7 |  -.0127136   .0677908    -0.19   0.851    -.1456175    .1201904
             |
     date_d2 |
 2016-04-08  |   .1595023   .0141189    11.30   0.000     .1318221    .1871824
 2016-04-09  |   .3237557    .019377    16.71   0.000      .285767    .3617443
 2016-04-10  |   .5221719   .0299151    17.46   0.000     .4635233    .5808206
 2016-04-11  |   .9377828   .0346807    27.04   0.000     .8697912    1.005774
 2016-04-12  |   .3522624   .0172798    20.39   0.000     .3183854    .3861395
 2016-04-13  |    .191629   .0151074    12.68   0.000     .1620108    .2212471
 2016-04-14  |   .6259085   .0238918    26.20   0.000     .5790686    .6727484
 2016-04-15  |   .2275419   .0137978    16.49   0.000     .2004912    .2545926
 2016-04-16  |   1.156065   .0435711    26.53   0.000     1.070644    1.241487
 2016-04-17  |   1.357376   .0405124    33.51   0.000     1.277951    1.436801
 2016-04-18  |   .6497394   .0254546    25.53   0.000     .5998358    .6996431
 2016-04-19  |   1.532112   .0526967    29.07   0.000       1.4288    1.635424
 2016-04-20  |    1.41436   .0421729    33.54   0.000      1.33168     1.49704
 2016-04-21  |   1.217246   .0381597    31.90   0.000     1.142434    1.292058
 2016-04-22  |   .4885892   .0227433    21.48   0.000     .4440008    .5331775
 2016-04-23  |   1.068262   .0393718    27.13   0.000     .9910736    1.145451
 2016-04-24  |   .9370681    .036267    25.84   0.000     .8659666     1.00817
 2016-04-25  |    1.40579   .0439095    32.02   0.000     1.319705    1.491875
 2016-04-26  |   1.454975   .0545352    26.68   0.000     1.348058    1.561891
 2016-04-27  |   1.500392   .0526868    28.48   0.000       1.3971    1.603685
 2016-04-28  |   1.871601   .0601845    31.10   0.000     1.753609    1.989593
 2016-04-29  |   1.160965   .0354952    32.71   0.000     1.091377    1.230554
 2016-04-30  |   .8587333   .0312867    27.45   0.000     .7973958    .9200709
 2016-05-01  |   1.172574   .0411909    28.47   0.000     1.091819    1.253329
 2016-05-02  |   1.479588   .0474208    31.20   0.000     1.386619    1.572556
 2016-05-03  |   1.366918    .046289    29.53   0.000     1.276168    1.457667
 2016-05-04  |   .7413522   .0340827    21.75   0.000     .6745331    .8081714
 2016-05-05  |   .5135242   .0263986    19.45   0.000     .4617697    .5652786
 2016-05-06  |    2.21556   .0640087    34.61   0.000     2.090071    2.341049
 2016-05-07  |   1.205606   .0395209    30.51   0.000     1.128125    1.283086
 2016-05-08  |    .798592   .0336696    23.72   0.000     .7325828    .8646013
 2016-05-09  |   1.847913   .0708436    26.08   0.000     1.709024    1.986802
 2016-05-10  |   1.521216   .0573133    26.54   0.000     1.408854    1.633579
             |
       _cons |   .1285068   .0273928     4.69   0.000     .0748031    .1822105
-------------+----------------------------------------------------------------
     sigma_u |  1.7809032
     sigma_e |  1.7533178
         rho |  .50780474   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\m.callaghan\Documents\Github\twitteRCT\results/statareg.log
  log type:  text
 closed on:  12 May 2016, 10:40:34
---------------------------------------------------------------------------------------------------------------------------------------------
